# =========================================================
# Модель финансовых транзакций
#
# Используется для:
# - платежей
# - переводов
# - операций
# - accounting logic
# - reconciliation
# =========================================================

from sqlalchemy import (
    Column,
    Integer,
    String,
    Float,
    DateTime
)

from datetime import datetime

from app.db.base import Base


class Transaction(Base):

    # -----------------------------------------------------
    # Название таблицы в PostgreSQL
    # -----------------------------------------------------
    __tablename__ = "transactions"

    # -----------------------------------------------------
    # ID транзакции
    # -----------------------------------------------------
    id = Column(
        Integer,
        primary_key=True,
        index=True
    )

    # -----------------------------------------------------
    # Описание операции
    # -----------------------------------------------------
    description = Column(
        String,
        nullable=False
    )

    # -----------------------------------------------------
    # Сумма транзакции
    # -----------------------------------------------------
    amount = Column(
        Float,
        nullable=False
    )

    # -----------------------------------------------------
    # Валюта
    # Например:
    # USD
    # KZT
    # EUR
    # -----------------------------------------------------
    currency = Column(
        String,
        default="USD"
    )

    # -----------------------------------------------------
    # Статус операции
    #
    # Например:
    # pending
    # completed
    # failed
    # -----------------------------------------------------
    status = Column(
        String,
        default="pending"
    )

    # -----------------------------------------------------
    # Дата создания
    # -----------------------------------------------------
    created_at = Column(
        DateTime,
        default=datetime.utcnow
    )
